testTut/twoPhaseBox_timeSlurry/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)      // 0
    (1 0 0)      // 1
    (1 1 0)      // 2
    (0 1 0)      // 3
    (0 0 0.01)   // 4
    (1 0 0.01)   // 5
    (1 1 0.01)   // 6
    (0 1 0.01)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)    // front
            (4 5 6 7)    // back
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
